public class Main {
    public static void main(String[] args) {
        /*
        --------------------------------УСЛОВИЕ-----------------------------------
        1.17. В един текстов файл са зададени данни за квадрати, имащи страни
        съответно успоредни на координатните оси. На първия ред е число,
        указващо броя на фигурите, а на следващите редове са данните за тях.
        В един ред са данните х и Y за горната лява точка, последвани от Х и Y
        за долната дясна точка. Като разделител служи интервал. Да се състави
        Application на Java за прочитане на този файл и за графично представяне
        на квадратите.
        --------------------------------------------------------------------------
        */


    }
}